PGM
DCL        VAR(&SRCLIB)  TYPE(*CHAR) LEN(10) VALUE(QTEMP)
DCL        VAR(&BLDLIB)  TYPE(*CHAR) LEN(10) VALUE(LEAMACHINE)
DCL        VAR(&TGTLIB)  TYPE(*CHAR) LEN(10) VALUE(LEAMACHINE)
DCL        VAR(&IFSPATH) TYPE(*CHAR) LEN(100)              
CRTLIB     LIB(&BLDLIB)     
MONMSG     MSGID(CPF0000)   
CRTSRCPF   FILE(&BLDLIB/QCLSRC) RCDLEN(132)  
MONMSG     MSGID(CPF0000)  
ENDPGM
