PGM
DCL        VAR(&TGTLIB) TYPE(*CHAR) LEN(10)
RTVUSRPRF  CURLIB(&TGTLIB)
SBMJOB     CMD(CALL PGM(JUPYTERLAB)) +
             JOB(JUPYTERLAB) JOBQ(QSYS/QSYSNOMAX) +
             ALWMLTTHD(*YES) CURLIB(&TGTLIB)
ENDPGM
